Day 3/regftr /app/controllers/gifts_controller.rb

SELECT "gifts".* FROM "gifts" ORDER BY id ASC
---
    def index
        @gifts = Gift.all.order('id ASC')

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @found_gift = Gift.find(params[:id])

INSERT INTO "gifts" ("name", "value", "event", "gift_giver", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Box of Wine"], ["value", 28.75], ["event", "Christmas"], ["gift_giver", "Co-Worker"], ["created_at", "2020-09-19 18:07:38.301989"], ["updated_at", "2020-09-19 18:07:38.301989"]]
---
    def create
        @gift = Gift.new(gift_params)

        if @gift.save

SELECT "gifts".* FROM "gifts" WHERE "gifts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "gifts" SET "name" = $1, "value" = $2, "updated_at" = $3 WHERE "gifts"."id" = $4  [["name", "Best buy gift card"], ["value", 99.99], ["updated_at", "2020-09-19 18:17:04.422813"], ["id", 2]]
---
    def update
        @gift = Gift.find(params[:id])
        @gift.update(gift_params)

DELETE FROM "gifts" WHERE "gifts"."id" = $1  [["id", 6]]
---
    def destroy
        @gift = Gift.destroy(params[:id])

SELECT "gifts".* FROM "gifts"
---
    def random
        @random_gift = Gift.all.sample