Day 2/matrix_app_api /app/controllers/vehicles_controller.rb

SELECT "vehicles".* FROM "vehicles"
---
    def index
        render json: Vehicle.all